---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.CorruptModelException
source: html/65481ba1-1f08-e4e0-1d59-733c2d0e3596.htm
---
# CorruptModelException Members

Retrieves data needed to serialize the target object.